import math

a = 10
b = 20
c = 30

#1.	Найти результат выражения для произвольных значений a,b,c: a + b * (c / 2)

d = a + b * (c / 2)

print("Задание 1")
print("При a = %d, b = %d, c = %d d равно: %d" % (a, b, c, d))
print("--------------------------------------------")

#2.	Найти результат выражения для произвольных значений a,b: (a2 + b2) % 2

e = (a**2 + b**2) % 2

print("Задание 2")
print("При a = %d, b = %d e равно: %d" % (a, b, e))
print("--------------------------------------------")

#3.	Найти результат выражения для произвольных значений a,b,c: ( a + b ) / 12 * c % 4 + b

f = ( a + b ) / 12 * c % 4 + b
print("Задание 3")
print("При a = %d, b = %d , c = %d f равно: %d" % (a, b, c, f))
print("--------------------------------------------")

#4. Найти результат выражения для произвольных значений a,b,c: (a - b * c ) / ( a + b ) % c

g = (a - b * c ) / ( a + b ) % c
print("Задание 4")
print("При a = %d, b = %d, c = %d g равно: %0.2f" % (a, b, c, g))
print("--------------------------------------------")

#5.	Найти результат выражения для произвольных значений a,b,c: | a - b | /( a + b)3 - cos( c )

h = abs (a - b ) /( a + b)**3 - math.cos(c)
print("Задание 5")
print("При a = %d, b = %d, c = %d h равно: %0.3f" % (a, b, c, h))
print("--------------------------------------------")

#6.	Найти результат выражения для произвольных значений a,b,c: ( ln( 1 + c ) / -b )4+ | a |

f = (math.log( 1 + c ) / -b )**4+ abs(a)
print("Задание 6")
print("При a = %d, b = %d, c = %d f равно: %0.6f" % (a, b, c, f))
print("--------------------------------------------")

#7.	Преобразовать строку с американским форматом даты в европейский. Например, "05.17.2016" преобразуется в "17.05.2016"
                      #0123456789
american_date_style = "05.17.2016"

print("Задание 7")
print("american_date_style is:")
print("05.17.2016")
print("european_date_style is: ")
european_date_style = american_date_style [3:6] + american_date_style [0:3] + american_date_style [6:100]
print(european_date_style)
print("--------------------------------------------")

#8.	Дана строка с именем студента, в которой имя предшествует фамилии, например
# ‘Mark Zuckerberg‘. Написать программу, которая преобразует эту строку, ставя
# фамилию на первое место, а имя на второе. Т.е. ‘Mark Zuckerberg‘ -> ‘Zuckerberg Mark‘.

               #0123456789
name_surname = "Mark Zuckerberg"
surname_name = name_surname[5:15] + name_surname [0:4]
print("Задание 8")
print(surname_name)
print("--------------------------------------------")



