import math

#Найти результат выражения для произвольных значений a,b,c: a + b * ( c / 2 )
a = 2
b = 4
c = 6
print("Задание 1")
print (a + b * ( c / 2 ))h
print ("При a равном d% и при b равном d% и c равном d% получаем: %d" % (a,b,c))
print("------------------------------------------------------------------------")

#Найти результат выражения для произвольных значений a,b: (a2 + b2) % 2
a = 4
b = 3
print("Задание 2")
print ((a**2 + b**2) %2)
print ("При a равном d% и при b равном d% получаем: %d" %(a,b))
print("------------------------------------------------------------------------")

#Найти результат выражения для произвольных значений a,b,c: ( a + b ) / 12 * c % 4 + b
a = 1
b = 2
c = 3
print("Задание 3")
print(( a + b ) / 12 * c % 4 + b)
print ("При a равном d% и при b равном d% и c равном d% получаем:%d" %(a,b,c))
print("------------------------------------------------------------------------")

#Найти результат выражения для произвольных значений a,b,c: (a - b * c ) / ( a + b ) % c
a = 300
b = 20
c = 10
print("Задание 4")
print((a - b * c ) / ( a + b ) % c)
print ("При a равном d% и при b равном d% и c равном d% получаем:%d" %(a,b,c))
print("------------------------------------------------------------------------")

#Найти результат выражения для произвольных значений a,b,c:
# | a - b | /( a + b)3 - cos( c )
a = 200
b = 300
c = 30
print("Задание 5")
print(| a - b | /( a + b)**3 - math.cos( c ))
print ("При a равном d% и при b равном d% и c равном d% получаем:%d" %(a,b,c))
print("------------------------------------------------------------------------")

#Найти результат выражения для произвольных значений a,b,c:
# ( ln( 1 + c ) / -b )4+ | a |

a = 150
b = 250
c = 330
print("Задание 6")
print(( math.log( 1 + c ) / -b )4+ | a |)
print ("При a равном d% и при b равном d% и c равном d% получаем:%d" %(a,b,c))
print("------------------------------------------------------------------------")

#Преобразовать строку с американским форматом даты в европейский.
#Например, "05.17.2016" преобразуется в "17.05.2016"

                        #0123456789
American_current_date = "05:17:2016"
European_current_date = [3:5, 0:2, 6:]
print("Задание 7")
print("------------------------------------------------------------------------")

#Дана строка с именем студента, в которой имя предшествует фамилии,
#например,  ‘Mark Zuckerberg‘. Написать программу, которая преобразует
# эту строку, ставя фамилию на первое место, а имя на второе.
# Т.е. ‘Mark Zuckerberg‘ -> ‘Zuckerberg Mark‘.

Name_Family= "Mark Zuckerberg"
Family_name = [0: , :100]
print("Задание 8")
print("------------------------------------------------------------------------")




